tsharkMqtt/tsungLogs/20170418-1829/mqtt_csv.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">
   	 <clients>
   	     <client host="zhilu-ubuntu01" weight="1" maxusers="10000">
   	     	<ip value="192.168.10.166"/>	
   	     </client>
   	     			
   	    <client host="zhilu-ubuntu02" weight="1" maxusers="6000">
   	     	<ip value="192.168.10.164"/>
   	    </client>
   	 </clients>
	<servers>
          <server host="192.168.10.8" port="1883" type="tcp"/>
	</servers>

    <load>
		<arrivalphase phase="1" duration="40" unit="second"> 
			<session_setup name="mqtt_subscriber" probability="100"/> 
			<session_setup name="mqtt_publisher" probability="0"/> 
			<users maxnumber="1000" arrivalrate="50" unit="second"/> 
		 </arrivalphase> 
		 
		 <arrivalphase phase="2" duration="40" unit="second"> 
			<session_setup name="mqtt_subscriber" probability="0"/> 
			<session_setup name="mqtt_publisher" probability="100"/> 
			<users maxnumber="1000" arrivalrate="50" unit="second"/> 
		</arrivalphase> 
    </load>

    <options>
		<option name="ports_range" min="1025" max="65535"/>		
		<option name="file_server" id="subcsv" value="./csvs/sub.csv"/>		
		<option name="file_server" id="pubcsv" value="./csvs/pub.csv"/>
   </options>
 			
    <sessions> 	
	
		<session name="mqtt_publisher" probability="50" type="ts_mqtt">			 
			<setdynvars sourcetype="file" fileid="pubcsv" delimiter="," order="iter">
				<var name="pubid"/>
				<var name="pubtopic"/>
				<var name="pubmsg"/>
			</setdynvars>
			
			<request subst="true">
				<mqtt type="connect" clean_start="true" username="mqttclient" password="mqttclient" client_id="%%_pubid%%"/>
			</request>           
				
			<request subst="true">
				<mqtt type="publish" topic="%%_pubtopic%%">%%_pubmsg%%</mqtt>
			</request>
			
           	<request>
               		 <mqtt type="disconnect"/>
           	</request>
       	</session>

 		<session name="mqtt_subscriber" probability="50" type="ts_mqtt">
		
			<setdynvars sourcetype="file" fileid="subcsv" delimiter="," order="iter">
				<var name="subid"/>
				<var name="subtopic"/>
			</setdynvars>
	
			<request subst="true">
				<mqtt type="connect" clean_start="true" keepalive="60" username="mqttclient" password="mqttclient" client_id="%%_subid%%"/>
			</request>

			<request subst="true">
				<mqtt type="subscribe" topic="%%_subtopic%%"/>
			</request>
				
			<request>
				<mqtt type="waitForMessages" timeout="100"/>
			</request>

			<request>
				<mqtt type="disconnect"/>
			</request>
			
        </session>	
	
    </sessions>
</tsung>